package week2.task1;
/*
Задание 1
Работа с матрицами:

написать функцию для создания матрицы различных розмерностей и заполнения их элементов
(ручной ввод, рандомный, с файла (по желанию))
Сделать функцию умножения матрицы на число
Пример(умножение на 3) :
Сделать функцию сложения и вычитания двух матриц(если матрицы разной рамерности,
то усекать до найменьшей сторон из матриц)
функция транспонирования матрицы
Вывод всех диагональных элементов матрицы (наискось)

Задание по желанию:
Сделать функцию умножения матрицы на матрицу(не забыть проверки размерности сделать,
 кто не шарит, тот может поюзать гугл, с вопросом как умножаются матрицы)


 */

public class Task1 {
}
